yewei600/TM4C1294_Workspace/I2C_slave_write/main.c
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_i2c.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "driverlib/i2c.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "utils/uartstdio.h"
#include "driverlib/uart.h"


void InitSlaveI2C2(void){
	SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C2);

	SysCtlPeripheralReset(SYSCTL_PERIPH_I2C2);

	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);

	GPIOPinConfigure(GPIO_PN4_I2C2SDA);
	GPIOPinConfigure(GPIO_PN5_I2C2SCL);

	GPIOPinTypeI2CSCL(GPIO_PORTN_BASE,GPIO_PIN_5);
	GPIOPinTypeI2C(GPIO_PORTN_BASE,GPIO_PIN_4);

	I2CSlaveInit(I2C2_BASE,0x01);

}


 int main(void) {
	SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ | SYSCTL_OSC_MAIN | SYSCTL_USE_PLL | SYSCTL_CFG_VCO_480), 120000000);
	char cnt=0;

	InitSlaveI2C2();

	char string[8]="Canada";

	while(1){
		if(I2CSlaveStatus(I2C2_BASE)==I2C_SLAVE_ACT_TREQ){
			I2CSlaveDataPut(I2C2_BASE,string[cnt]);
			cnt++;
			cnt=cnt%6;
		}
		SysCtlDelay(1000000);
	}

	return 0;
}
